app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (created_at >= '2017-12-03 00:00:00.000000')
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = 8
---
  def index
    @posts = Post.all
    @authors = Author.all
    if !params[:author].blank?
      @posts = Post.by_author(params[:author])
    elsif !params[:date].blank?
      if params[:date] == "Today"
        @posts = Post.from_today
      else
        @posts = Post.old_news
      end
    else
      @posts = Post.all